Revit 2027 API
ScheduleHeightsOnSheet.ColumnHeaderHeight Property
 The height of all schedule header part, including the gap line between header and body.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ColumnHeaderHeight { get; }
Public ReadOnly Property ColumnHeaderHeight As Double
	Get
public:
property double ColumnHeaderHeight {
	double get ();
}
member ColumnHeaderHeight : float with get
Property Value
Double
See Also
Reference
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace